Revit 2027 API
TextElement.HorizontalAlignment Property
 Horizontal alignment of the text content within the text area of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HorizontalTextAlignment HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As HorizontalTextAlignment
	Get
	Set
public:
property HorizontalTextAlignment HorizontalAlignment {
	HorizontalTextAlignment get ();
	void set (HorizontalTextAlignment value);
}
member HorizontalAlignment : HorizontalTextAlignment with get, set
Property Value
HorizontalTextAlignment
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TextElement Class
Autodesk.Revit.DB Namespace